# PreviousVersion Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReloadSwapOutInfo..::..PreviousVersion Property
ReloadSwapOutInfo Class See Also
---
Previous version.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public int PreviousVersion { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PreviousVersion As Integer
	Get
```

Visual C++
---
```text
public:
property int PreviousVersion {
	int get ();
}
```

# See Also
ReloadSwapOutInfo Class
Autodesk.Revit.DB Namespace